In [2]:
#Agenda

In [5]:
import numpy as mm
import pandas as pd
from pandas import Series, DataFrame

In [6]:
revenue_series= Series([100,200,300,mm.nan], index=['Audi', 'Honda', 'Bmw','Crv'])
print(revenue_series)

Audi     100.0
Honda    200.0
Bmw      300.0
Crv        NaN
dtype: float64

In [7]:
revenue_series.isnull()

Audi     False
Honda    False
Bmw      False
Crv       True
dtype: bool

In [8]:
revenue_series.notnull()

Audi      True
Honda     True
Bmw       True
Crv      False
dtype: bool

In [10]:
revenue_series.dropna()

Audi     100.0
Honda    200.0
Bmw      300.0
dtype: float64

In [11]:
#DataFrame - drop
df1 = DataFrame(mm.random.randn(12).reshape(4,3))
print(df1)

          0         1         2
0  0.497397 -0.456370  0.582964
1 -0.344219 -0.210650  0.559900
2  2.081480 -0.116702  1.037551
3 -0.524806  0.342370 -1.000902

In [12]:
df1.loc[1,2] = mm.nan
df1.loc[2,1] = mm.nan
df1.loc[3,] = mm.nan
print(df1)

          0        1         2
0  0.497397 -0.45637  0.582964
1 -0.344219 -0.21065       NaN
2  2.081480      NaN  1.037551
3       NaN      NaN       NaN

In [13]:
df1.dropna()

          0        1         2
0  0.497397 -0.45637  0.582964

In [16]:
df1.dropna(how="all")

          0        1         2
0  0.497397 -0.45637  0.582964
1 -0.344219 -0.21065       NaN
2  2.081480      NaN  1.037551

In [18]:
#dataframe - dropna() along column
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [19]:
#dropna with thresh parameter
df2 = DataFrame([ [1,2,3,mm.nan], [4,5,6,7],
                 [8,9,mm.nan,mm.nan], 
                 [12, mm.nan, mm.nan,mm.nan]])
print(df2)

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [20]:
df2.dropna(thresh=3)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [21]:
df2.dropna(thresh=2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0
2  8  9.0  NaN  NaN

In [22]:
#fillna () function
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [28]:
#fillna () function
df2.fillna({0:0, 1:50, 2:100, 3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0